# GNU versions

brew "coreutils"
brew "findutils"
brew "grep"
brew "gnu-sed"

# Keychain

brew "gnupg"

# newer than macos, though probably don't need anymore

brew "git"
brew "git-lfs"
brew "vim"
brew "zsh"

# misc tools

brew "fzf"
brew "jq"
brew "parallel"
brew "pv"
brew "ripgrep"
brew "the_silver_searcher"
brew "tmux"
cask "alacritty"

# container/versioning tools
brew "podman"
brew "asdf"

# debugging/reverse engineering tools

brew "binutils"
# brew "gdb" # Doesn't work on Apple Silicon, using lldb instead
brew "htop"
brew "hydra"
brew "radare2"
brew "socat"

# build utils
brew "cmake"
