# GNU versions

brew "coreutils"
brew "findutils"
brew "grep"
brew "gnu-sed"

# Keychain

brew "gnupg"

# newer than macos, though probably don't need anymore

brew "git"
brew "git-lfs"
brew "vim"
brew "zsh"

# misc tools

brew "fzf"
brew "jq"
brew "parallel"
brew "pv"
brew "ripgrep"
brew "the_silver_searcher"
brew "tmux"
cask "alacritty"
cask "powershell"

# container/versioning tools
brew "podman"
brew "asdf"

# debugging/reverse engineering tools

brew "binutils"
# brew "gdb" # Doesn't work on Apple Silicon, using lldb instead
brew "htop"
brew "hydra"
brew "radare2"
brew "socat"


# build utils for asdf/erlang/etc.

brew "autoconf"
brew "bazelisk"
brew "cmake"
brew "fop"
brew "libxslt"
brew "meson"
brew "openssl@1.1"
brew "wxwidgets"

# image/video tools
brew "ffmpeg"
brew "gifsicle"

# prod tools
brew "flyctl"
brew "gh" # github, fyi

brew "python@3.10"

# python dev libs
brew "openssl"
brew "xz"
brew "gdbm"

# misc libs
brew "boost"
